Autodesk.Revit.DB.Steel.SteelElementProperties.GetNeededExtension(System.Int32)
Gets current minimum elongation requirement.
end:
The end to get extension for: 0: start, 1: end.
Returns:
The current exrension requirement value.
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.SetNeededExtension(System.Int32,System.Double)
Adds a requirement that the beam be at lest this much elongated at start
end:
The end to set extension for: 0: start, 1: end.
value:
The value to be set.
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.SolidsAreEqualWithTransforms(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,System.Collections.Generic.IList{Autodesk.Revit.DB.Transform}@)
Returns true if the two input solids are equal geometrically and provides up to maxTransforms transformations.
solid1:
solid object
solid2:
the other solid object to compare with
transforms:
Array of transformations that map solid1 to solid2 (if equal)
Returns:
true if solids are geometrically equal
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.MakeDimensionRefsLazyForSteelElement(Autodesk.Revit.DB.Document)
Converts dimension witness references (linear and angular) on this beam/column from regular geometry
references to lazy references, so they survive the geometry shift caused by SteelConnections extensions.
pDoc:
Document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.ResetHistoryAndUpdateFaceEndTags(Autodesk.Revit.DB.Document)
Helper function to preserve Face end tags
pDoc:
Document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties
This class is used to attach steel fabrication information to various Revit elements.
extensions at both element ends
Remarks:
Revit elements which can have fabrication information are:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlatesSome concrete elements (walls, floors, concrete beams, ...) when they are input elements to detailed steel connections.
The class also holds the link to the Steel Core elements.
Since:
2019